# Comment
# 프로그램이 실행 될 때 작동되지 않고 오로지 설명을 위한 내용을 작성 할 때 사용
# 한줄 주석 : 주석 할 내용 앞에 #을 붙인다.

# 여러줄 주석 : 처음에 쌍따옴표 3개 마지막에 쌍따옴표 3개

'''
동해 물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세.
무궁화 삼천리 화려 강산
대한 사람, 대한으로 길이 보전하세.
'''


# 가장 왼쪽 벽에 붙여서 코드를 작성한다.

# 출력할 내용이 문자일경우 홀따옴표를 양쪽에 붙이거나 쌍따옴표를 양쪽에 붙이지만 상관은 없다
print("안녕하세요.")
print('반갑습니다')

# 출력 할 내용이 정수인 경우는 그냥 숫자만 적는다.
# 정수 = 소수 점이 없는 수
print(58)

# 출력할 내용이 실수인 경우는 소수점 아래는 . 을 이용한다.
# 실수 = 소수점이 있는 수
print(3.14)

# 숫자와 문자를 한번에 출력하기
# 숫자와 문자를 한번에 출력 할 때는 ,(콤마)를 사용해야 하지만 에러가 발생 한다
print("사과", 5, "개를 주세요.")
print("파이썬", 2, "번째 실습예제.")

 